CREATE TABLE IF NOT EXISTS `books` (
    `id` int(11) NOT NULL AUTO_INCREMENT,
    `name` varchar(32) NOT NULL,
    `year` varchar(4) NOT NULL,
    `author` varchar(32) NOT NULL,
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `books` (`id`, `name`,`year`,`author`) VALUES 
(1,"Мастер и Маргарита","1929","Михаил Булгаков"),
(2,"Собачье сердце","1925","Михаил Булгаков"),
(3,"Денадцать стульев","1928","Евгений Петров"),
(4,"Мёртвые души","1842","Николай Гоголь"),
(5,"Граф Монте-Кристо","1844","Александр Дюма"),
(6,"Зеолотой теленок","1931","Евгений Петров"),
(7,"Три товарища","1936","Эрих Мария Ремарк"),
(8,"Отверженные","1862","Виктор Гюго"),
(9,"Евгений Онегин","1825","Александр Пушкин"),
(10,"Преступление и наказание","1866","Федор Достоевский");